Tekla Open API Reference for Tekla Structures 2025
Arc.Clone Method
 Returns a copy of itself
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ICurve Clone()
Public Function Clone As ICurve
Return Value
Type: ICurve
The copy
Implements
ICurve.Clone()
See Also
Reference
Arc Class
Tekla.Structures.Geometry3d Namespace